import required modules

In [18]:
import pandas as pd
import os

In [19]:
df = pd.read_csv('2019 Winter Data Science Intern Challenge Data Set - Sheet1.csv')
df.head(10)

,order_id,shop_id,user_id,order_amount,total_items,payment_method,created_at
0,1,53,746,224,2,cash,2017-03-13 12:36:56
1,2,92,925,90,1,cash,2017-03-03 17:38:52
2,3,44,861,144,1,cash,2017-03-14 4:23:56
3,4,18,935,156,1,credit_card,2017-03-26 12:43:37
4,5,18,883,156,1,credit_card,2017-03-01 4:35:11
5,6,58,882,138,1,credit_card,2017-03-14 15:25:01
6,7,87,915,149,1,cash,2017-03-01 21:37:57
7,8,22,761,292,2,cash,2017-03-08 2:05:38
8,9,64,914,266,2,debit,2017-03-17 20:56:50
9,10,52,788,146,1,credit_card,2017-03-30 21:08:26

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   order_id        5000 non-null   int64
 1   shop_id         5000 non-null   int64
 2   user_id         5000 non-null   int64
 3   order_amount    5000 non-null   int64
 4   total_items     5000 non-null   int64
 5   payment_method  5000 non-null   object
 6   created_at      5000 non-null   object
dtypes: int64(5), object(2)
memory usage: 273.6+ KB

In [21]:
df.dropna()

,order_id,shop_id,user_id,order_amount,total_items,payment_method,created_at
0,1,53,746,224,2,cash,2017-03-13 12:36:56
1,2,92,925,90,1,cash,2017-03-03 17:38:52
2,3,44,861,144,1,cash,2017-03-14 4:23:56
3,4,18,935,156,1,credit_card,2017-03-26 12:43:37
4,5,18,883,156,1,credit_card,2017-03-01 4:35:11
...,...,...,...,...,...,...,...
4995,4996,73,993,330,2,debit,2017-03-30 13:47:17
4996,4997,48,789,234,2,cash,2017-03-16 20:36:16
4997,4998,56,867,351,3,cash,2017-03-19 5:42:42
4998,4999,60,825,354,2,credit_card,2017-03-16 14:51:18
4999,5000,44,734,288,2,debit,2017-03-18 15:48:18

In [22]:
df.describe()

          order_id      shop_id      user_id   order_amount  total_items
count  5000.000000  5000.000000  5000.000000    5000.000000   5000.00000
mean   2500.500000    50.078800   849.092400    3145.128000      8.78720
std    1443.520003    29.006118    87.798982   41282.539349    116.32032
min       1.000000     1.000000   607.000000      90.000000      1.00000
25%    1250.750000    24.000000   775.000000     163.000000      1.00000
50%    2500.500000    50.000000   849.000000     284.000000      2.00000
75%    3750.250000    75.000000   925.000000     390.000000      3.00000
max    5000.000000   100.000000   999.000000  704000.000000   2000.00000

In [23]:
df['order_amount'].mean()

3145.128

In [163]:
df['order_amount'].median()

284.0

In [164]:
df['order_amount'].mode()

0    153
dtype: int64

Visualize the order numbers and amount per shop

In [27]:
df['created_at'].isin(['2017-03-01','2017-03-31'])

0       False
1       False
2       False
3       False
4       False
        ...
4995    False
4996    False
4997    False
4998    False
4999    False
Name: created_at, Length: 5000, dtype: bool

In [29]:
df['created_at'].dtype

dtype('O')

In [44]:
dates = pd.to_datetime(df['created_at']).dt.date

In [45]:
dates.head()

0    2017-03-13
1    2017-03-03
2    2017-03-14
3    2017-03-26
4    2017-03-01
Name: created_at, dtype: object

In [65]:
df[(df['created_at'] > '2017-03-01') & (df['created_at'] <= '2017-03-31') == False].count()

order_id          0
shop_id           0
user_id           0
order_amount      0
total_items       0
payment_method    0
created_at        0
dtype: int64

In [67]:
df['order_id'].nunique()

5000

In [70]:
df.order_amount.sum()/df.order_id.count()

3145.128

In [162]:
new_df = df.groupby(['shop_id'],as_index=True)[['order_amount'],['total_items']]

/Library/Frameworks/Python.framework/Versions/3.7/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  """Entry point for launching an IPython kernel.

TypeError: unhashable type: 'list'

In [147]:
new_df['aov'] = new_df['order_amount']/new_df['total_items']

In [148]:
new_df.sort_values(by='aov',ascending=False)

         order_id  user_id  order_amount  total_items      aov
shop_id
78         122499    39916       2263800           88  25725.0
42         124538    38688      11990176        34063    352.0
12         135437    44755         18693           93    201.0
89         172859    50618         23128          118    196.0
99         128844    45693         18330           94    195.0
...           ...      ...           ...          ...      ...
53         162752    58381         14560          130    112.0
100         94261    34093          8547           77    111.0
32          96561    35986          7979           79    101.0
2          126448    47370          9588          102     94.0
92         102864    36334          6840           76     90.0

[100 rows x 5 columns]

In [150]:
new_df = new_df.drop(78)

In [156]:
final_aov = new_df['aov'].sum()/len(new_df.index)

In [157]:
round(final_aov,2)

152.26